# Practice for phase 2 in SQL

In [11]:
# modules
import pandas as pd 
import sqlite3

In [ ]:
# Check directory
!ls 
# Check directory
# !dir

README.md
images
index.ipynb

In [16]:
con = sqlite3.connect('test-db.db')

In [18]:
!ls
# >>>
# README.md
# images
# index.ipynb
# test-db.db

README.md
images
index.ipynb
test-db.db

In [ ]:
# cursor-object 
# helps execute any-command in this platform
cur = con.cursor()

In [34]:
# Create A DATABASE
cur.execute('''
CREATE TABLE IF NOT EXISTS employees(
            id INT PRIMARY KEY,
            name TEXT,
            age INT,
            dept VARCHAR,
            salary INT
            )
'''
);

In [ ]:
# INSERTING data into the TABLE
cur.execute("""
            INSERT INTO employees(
                id, name, age, dept, salary
            )VALUES
            (1, 'BRIAN', 30, 'EDU', 120000),
            (2, 'SAMUEL', 15, 'IT', 540000),
            (3, 'PAMELA', 50, 'UON', 256000)
            """);
con.commit()

IntegrityError: UNIQUE constraint failed: employees.id

In [27]:
con.execute('''
            SELECT * FROM employees
''');
rows = cur.fetchall()
# display the result
rows

[]

In [40]:
# Fetching the data
cur.execute("SELECT * FROM employees")
rows = cur.fetchall()
for row in rows:
    print(row)

(1, 'BRIAN', 30, 'EDU', 120000)
(2, 'SAMUEL', 15, 'IT', 540000)
(3, 'PAMELA', 50, 'UON', 256000)
(4, 'BRIAN', 30, 'EDU', 120000)
(5, 'SAMUEL', 15, 'IT', 540000)
(6, 'PAMELA', 50, 'UON', 256000)
(7, 'BRIAN', 30, 'EDU', 120000)
(8, 'SAMUEL', 15, 'IT', 540000)
(9, 'PAMELA', 50, 'UON', 256000)

In [ ]:
# adding more similar
cur.execute("""
    INSERT INTO employees(
        id, name, age, dept, salary
    ) VALUES
    (7, 'BRIAN', 30, 'EDU', 120000),
    (8, 'SAMUEL', 15, 'IT', 540000),
    (9, 'PAMELA', 50, 'UON', 256000)
""");
con.commit()

In [43]:
# Others
rows

[(1, 'BRIAN', 30, 'EDU', 120000),
 (2, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (4, 'BRIAN', 30, 'EDU', 120000),
 (5, 'SAMUEL', 15, 'IT', 540000),
 (6, 'PAMELA', 50, 'UON', 256000),
 (7, 'BRIAN', 30, 'EDU', 120000),
 (8, 'SAMUEL', 15, 'IT', 540000),
 (9, 'PAMELA', 50, 'UON', 256000)]

# WHERE clause

In [45]:
cur.execute("""
            SELECT * FROM employees
            WHERE age < 40
            """);
con.commit()

In [46]:
where = cur.fetchall()
where

[(1, 'BRIAN', 30, 'EDU', 120000),
 (2, 'SAMUEL', 15, 'IT', 540000),
 (4, 'BRIAN', 30, 'EDU', 120000),
 (5, 'SAMUEL', 15, 'IT', 540000),
 (7, 'BRIAN', 30, 'EDU', 120000),
 (8, 'SAMUEL', 15, 'IT', 540000)]

In [47]:
cur.execute("""
            SELECT * FROM employees
            WHERE age < 40 AND age > 20
            """);
con.commit()

In [48]:
where2 = cur.fetchall()
where2

[(1, 'BRIAN', 30, 'EDU', 120000),
 (4, 'BRIAN', 30, 'EDU', 120000),
 (7, 'BRIAN', 30, 'EDU', 120000)]

# ORDER BY

In [49]:
cur.execute("""
            SELECT * FROM employees
            ORDER BY salary DESC
            """);
con.commit()

In [ ]:
# ORDER by clause fetch
order = cur.fetchall()
# output
order

[(2, 'SAMUEL', 15, 'IT', 540000),
 (5, 'SAMUEL', 15, 'IT', 540000),
 (8, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (6, 'PAMELA', 50, 'UON', 256000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (1, 'BRIAN', 30, 'EDU', 120000),
 (4, 'BRIAN', 30, 'EDU', 120000),
 (7, 'BRIAN', 30, 'EDU', 120000)]

In [51]:
cur.execute("""
            SELECT * FROM employees
            ORDER BY salary ASC
            """);
con.commit()
# order2
order2 = cur.fetchall()
order2

[(1, 'BRIAN', 30, 'EDU', 120000),
 (4, 'BRIAN', 30, 'EDU', 120000),
 (7, 'BRIAN', 30, 'EDU', 120000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (6, 'PAMELA', 50, 'UON', 256000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (2, 'SAMUEL', 15, 'IT', 540000),
 (5, 'SAMUEL', 15, 'IT', 540000),
 (8, 'SAMUEL', 15, 'IT', 540000)]